In [1]:
import pandas as pd
# data cleaning  -- 1 null vlaue , 2 deduplication , 3 difffernt types of data - transformation 

# ____ HAndle missing Value _____

In [2]:
# 1 - missing values isnull()

df = pd.read_csv("raw_data.csv")

df.isnull()  # jaha pae null value ha ya Nan ha 
df.isna() # same kamm ha isnull jasa

# different function kee chaining
df.isnull().sum()

# dropna() -- null vlaue ko drop kardetaha row ko pura # rows
df.dropna()

# column ko drop karna ha 
df.dropna(axis=1) # column ko drop karta ha 


# fillna -- jo null vlaue usko kisi particular value sae fill karsakta ha
df.fillna(0)

age_mean = df["age"].mean() # avergae value  # lakin ek chiz original mae koi chnage nai hoga
cleaned_data = df.copy()
cleaned_data["age"]=cleaned_data["age"].fillna(age_mean)
cleaned_data

# ffill and bfill - ffill stands for forward fill -- upar sae nicha kae forward kardega upar kee vlaue ko neecha copy kardega asa he backward fill


df.ffill()
df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [3]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [4]:
# handle duplicate vales 
# .duplicated()

df.duplicated()
df["country"].duplicated()
df[["country","gender"]].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [5]:
df.drop_duplicates()  # yae hamara original data ame tou koi chnage ni dega tou thenham
df2 = df.copy()
df2.fillna(0)
df.drop_duplicates(inplace = True)

In [6]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [7]:
# handle data types and date time 
df.dtypes
df2 = df.copy()
df2 .fillna(0)
# astype - new data type
#df2 = df["age"].astype("int64").copy()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [8]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [9]:
# date - time 
date_str = pd.Series([pd.to_datetime("2026-12-31")])
type(date_str.dtypes)

numpy.dtypes.DateTime64DType

In [10]:
# handle string in data cleaning
df["gender"].str.lower()
df["gender"].str.upper()
df["gender"].str.capitalize()


df["name"].str.split()
#df["name"].str.split(@)  # harsh@gmail.com
df["country"].str.contains("india",case = False)

0     False
2     False
3     False
4     False
5     False
6      True
7     False
8     False
9     False
10    False
Name: country, dtype: bool

In [11]:
# transforming our data to feature enginnering---yyy


df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [12]:
df2 = df.copy()

df2["tax"]  = df2["income"].apply(lambda x : "20%" if x >= 50000 else "10%") # function kae andar function tab apply use karta bahr wla functn  highh order function ha 

df2

    id          name   age country   gender   income  tax
0    1      John Doe  29.0     USA     Male  55000.0  20%
2    2    Jane Smith   NaN  Canada   Female  62000.0  20%
3    3          Alex   NaN     USA  Unknown  47000.0  10%
4    4  Maria Garcia  34.0   Spain   Female      NaN  10%
5    5        Li Wei  27.0   China     Male  51000.0  20%
6    6           NaN  45.0   India   Female  73000.0  20%
7    7    Ahmed Khan  38.0     NaN     Male  68000.0  20%
8    8    Rachel Lee  29.0     USA   Female  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0  10%
10  10   Emily Davis  31.0     USA      NaN  58000.0  20%

In [13]:
# map function
#Male => M , Female => F , Unkonown => U 
df2 = df.copy()
gender_map = {
    "Male" : "M",
    "Female" : "F",
    "Unknown " : "U"
}
df2["gender"].map(gender_map)

0       M
2       F
3     NaN
4       F
5       M
6       F
7       M
8       F
9       M
10    NaN
Name: gender, dtype: str

In [14]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [15]:
# assign function 
df2.assign(new_income = df2["income"] * 1.1)

    id          name   age country   gender   income  new_income
0    1      John Doe  29.0     USA     Male  55000.0     60500.0
2    2    Jane Smith   NaN  Canada   Female  62000.0     68200.0
3    3          Alex   NaN     USA  Unknown  47000.0     51700.0
4    4  Maria Garcia  34.0   Spain   Female      NaN         NaN
5    5        Li Wei  27.0   China     Male  51000.0     56100.0
6    6           NaN  45.0   India   Female  73000.0     80300.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0     74800.0
8    8    Rachel Lee  29.0     USA   Female  62000.0     68200.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0     49500.0
10  10   Emily Davis  31.0     USA      NaN  58000.0     63800.0

In [16]:
# replace fucntion old - new 
df["country"].replace("USA" , "US")

0         US
2     Canada
3         US
4      Spain
5      China
6      India
7        NaN
8         US
9     Mexico
10        US
Name: country, dtype: str

In [17]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [18]:
 # rename 
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [22]:
df2.columns = ["ID","NAME" ,"AGE " , "COUNTRY","GENDER" , "INCOME"]

In [23]:
df2

    ID          NAME  AGE  COUNTRY   GENDER   INCOME
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [32]:
df2.rename(columns={"INCOME":"SALARY"})

    ID          NAME  AGE  COUNTRY   GENDER   SALARY
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [34]:
df2.rename(index= {2:"First"})

       ID          NAME  AGE  COUNTRY   GENDER   INCOME
0       1      John Doe  29.0     USA     Male  55000.0
First   2    Jane Smith   NaN  Canada   Female  62000.0
3       3          Alex   NaN     USA  Unknown  47000.0
4       4  Maria Garcia  34.0   Spain   Female      NaN
5       5        Li Wei  27.0   China     Male  51000.0
6       6           NaN  45.0   India   Female  73000.0
7       7    Ahmed Khan  38.0     NaN     Male  68000.0
8       8    Rachel Lee  29.0     USA   Female  62000.0
9       9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10     10   Emily Davis  31.0     USA      NaN  58000.0

In [38]:
df2.sort_values("INCOME")

    ID          NAME  AGE  COUNTRY   GENDER   INCOME
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
3    3          Alex   NaN     USA  Unknown  47000.0
5    5        Li Wei  27.0   China     Male  51000.0
0    1      John Doe  29.0     USA     Male  55000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
6    6           NaN  45.0   India   Female  73000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN

In [41]:
 df2.sort_values("INCOME",ascending = False)

    ID          NAME  AGE  COUNTRY   GENDER   INCOME
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0
0    1      John Doe  29.0     USA     Male  55000.0
5    5        Li Wei  27.0   China     Male  51000.0
3    3          Alex   NaN     USA  Unknown  47000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN

In [42]:
df2.sort_index()

    ID          NAME  AGE  COUNTRY   GENDER   INCOME
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [44]:
# reset 
df2
df2.reset_index()

   index  ID          NAME  AGE  COUNTRY   GENDER   INCOME
0      0   1      John Doe  29.0     USA     Male  55000.0
1      2   2    Jane Smith   NaN  Canada   Female  62000.0
2      3   3          Alex   NaN     USA  Unknown  47000.0
3      4   4  Maria Garcia  34.0   Spain   Female      NaN
4      5   5        Li Wei  27.0   China     Male  51000.0
5      6   6           NaN  45.0   India   Female  73000.0
6      7   7    Ahmed Khan  38.0     NaN     Male  68000.0
7      8   8    Rachel Lee  29.0     USA   Female  62000.0
8      9   9   Carlos Ruiz   NaN  Mexico     Male  45000.0
9     10  10   Emily Davis  31.0     USA      NaN  58000.0

In [47]:
# rank method 
df2["Rank"] =df2["INCOME"].rank()
df2

    ID          NAME  AGE  COUNTRY   GENDER   INCOME  Rank
0    1      John Doe  29.0     USA     Male  55000.0   4.0
2    2    Jane Smith   NaN  Canada   Female  62000.0   6.5
3    3          Alex   NaN     USA  Unknown  47000.0   2.0
4    4  Maria Garcia  34.0   Spain   Female      NaN   NaN
5    5        Li Wei  27.0   China     Male  51000.0   3.0
6    6           NaN  45.0   India   Female  73000.0   9.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0   8.0
8    8    Rachel Lee  29.0     USA   Female  62000.0   6.5
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0   1.0
10  10   Emily Davis  31.0     USA      NaN  58000.0   5.0

In [48]:
df2["Rank"] =df2["INCOME"].rank(ascending = False)
df2

    ID          NAME  AGE  COUNTRY   GENDER   INCOME  Rank
0    1      John Doe  29.0     USA     Male  55000.0   6.0
2    2    Jane Smith   NaN  Canada   Female  62000.0   3.5
3    3          Alex   NaN     USA  Unknown  47000.0   8.0
4    4  Maria Garcia  34.0   Spain   Female      NaN   NaN
5    5        Li Wei  27.0   China     Male  51000.0   7.0
6    6           NaN  45.0   India   Female  73000.0   1.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0   2.0
8    8    Rachel Lee  29.0     USA   Female  62000.0   3.5
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0   9.0
10  10   Emily Davis  31.0     USA      NaN  58000.0   5.0

In [49]:
 # TASK 
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0